# GetPatternTableIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternTable..::..GetPatternTableIterator Method
ExportPatternTable Class See Also
---
Returns a PatternTableIterator that iterates through the collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExportPatternTableIterator GetPatternTableIterator()
```

Visual Basic
---
```text
Public Function GetPatternTableIterator As ExportPatternTableIterator
```

Visual C++
---
```text
public:
ExportPatternTableIterator^ GetPatternTableIterator()
```

# ### Return Value
A PatternTableIterator object that can be used to iterate through key-value pairs in the collection.
# See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace